Terraform will perform the following actions:

  # module.aws.aws_s3_bucket_lifecycle_configuration.hrm_export_expiry will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "hrm_export_expiry" {
      + bucket = "tl-aselo-docs-in-production"
      + id     = (known after apply)

      + rule {
          + id     = "HRM Exported Data Expiration Policy"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
              + prefix = "hrm-data/"
            }
        }
    }

  # module.aws.aws_s3_bucket_ownership_controls.chat will be created
  + resource "aws_s3_bucket_ownership_controls" "chat" {
      + bucket = "tl-public-chat-in-prod"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.aws.aws_s3_bucket_ownership_controls.docs will be created
  + resource "aws_s3_bucket_ownership_controls" "docs" {
      + bucket = "tl-aselo-docs-in-production"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.aws.aws_ssm_parameter.aws_region will be created
  + resource "aws_ssm_parameter" "aws_region" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - account SID by short helpline"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/aws/AC64efffad72dccd812ca0c156355217ed/region"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/aws/AC64efffad72dccd812ca0c156355217ed/region"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/aws/AC64efffad72dccd812ca0c156355217ed/region"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.datadog_access_token will be created
  + resource "aws_ssm_parameter" "datadog_access_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Datadog - Access Token"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/datadog/AC64efffad72dccd812ca0c156355217ed/access_token"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/datadog/AC64efffad72dccd812ca0c156355217ed/access_token"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/datadog/AC64efffad72dccd812ca0c156355217ed/access_token"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.datadog_app_id will be created
  + resource "aws_ssm_parameter" "datadog_app_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Datadog - Application ID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/datadog/AC64efffad72dccd812ca0c156355217ed/app_id"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/datadog/AC64efffad72dccd812ca0c156355217ed/app_id"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/datadog/AC64efffad72dccd812ca0c156355217ed/app_id"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.main_group["ACCESS_TOKEN"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ description = (sensitive value)
        id          = "PROD_DATADOG_IN_ACCESS_TOKEN"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name        = (sensitive value)
        tags        = {}
        # (8 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["APP_ID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ description = (sensitive value)
        id          = "PROD_DATADOG_IN_APP_ID"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name        = (sensitive value)
        tags        = {}
        # (8 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["CHAT_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_IN_CHAT_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Chat transfer workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_IN_CHAT_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_IN_CHAT_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 2 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["OPERATING_INFO_KEY"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
        id             = "PROD_TWILIO_IN_OPERATING_INFO_KEY"
      + insecure_value = (known after apply)
        name           = "PROD_TWILIO_IN_OPERATING_INFO_KEY"
        tags           = {}
      ~ value          = (sensitive value)
      ~ version        = 2 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["POST_SURVEY_BOT_CHAT_URL"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ description    = (sensitive value)
        id             = "PROD_TWILIO_IN_POST_SURVEY_BOT_CHAT_URL"
      + insecure_value = (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name           = (sensitive value)
        tags           = {}
      ~ value          = (sensitive value)
      ~ version        = 2 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["SURVEY_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_IN_SURVEY_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Survey Workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_IN_SURVEY_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_IN_SURVEY_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 2 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.s3_docs_bucket_id will be created
  + resource "aws_ssm_parameter" "s3_docs_bucket_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "S3 - Docs bucket name"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/s3/AC64efffad72dccd812ca0c156355217ed/docs_bucket_name"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/s3/AC64efffad72dccd812ca0c156355217ed/docs_bucket_name"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/s3/AC64efffad72dccd812ca0c156355217ed/docs_bucket_name"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.serverless_base_url will be created
  + resource "aws_ssm_parameter" "serverless_base_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Serverless - Base URL"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/serverless/AC64efffad72dccd812ca0c156355217ed/base_url"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/serverless/AC64efffad72dccd812ca0c156355217ed/base_url"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/serverless/AC64efffad72dccd812ca0c156355217ed/base_url"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_auth_token will be created
  + resource "aws_ssm_parameter" "twilio_auth_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Auth Token"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/auth_token"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/auth_token"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/auth_token"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_service_sid will be created
  + resource "aws_ssm_parameter" "twilio_chat_service_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Chat service SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/chat_service_sid"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/chat_service_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/chat_service_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_workflow_sid will be created
  + resource "aws_ssm_parameter" "twilio_chat_workflow_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Chat Workflow SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/chat_workflow_sid"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/chat_workflow_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/chat_workflow_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_flex_proxy_service_sid will be created
  + resource "aws_ssm_parameter" "twilio_flex_proxy_service_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Flex Proxy service SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/flex_proxy_service_sid"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/flex_proxy_service_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/flex_proxy_service_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_operating_info_key will be created
  + resource "aws_ssm_parameter" "twilio_operating_info_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Operating Info Key"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/operating_info_key"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/operating_info_key"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/operating_info_key"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_post_survey_bot_chat_url[0] will be created
  + resource "aws_ssm_parameter" "twilio_post_survey_bot_chat_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Post Survey Bot Chat URL"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/post_survey_bot_chat_url"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/post_survey_bot_chat_url"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/post_survey_bot_chat_url"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_short_helpline_to_account_sid will be created
  + resource "aws_ssm_parameter" "twilio_short_helpline_to_account_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - account SID by short helpline"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/IN/account_sid"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/IN/account_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/IN/account_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_survey_workflow_sid will be created
  + resource "aws_ssm_parameter" "twilio_survey_workflow_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Survey Workflow SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/survey_workflow_sid"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/survey_workflow_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/survey_workflow_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_sync_sid will be created
  + resource "aws_ssm_parameter" "twilio_sync_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Sync service SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/sync_sid"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/sync_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/sync_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_workspace_sid will be created
  + resource "aws_ssm_parameter" "twilio_workspace_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Workspace SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/workspace_sid"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/workspace_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC64efffad72dccd812ca0c156355217ed/workspace_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.flex.twilio_flex_flex_flows_v1.messaging_flow will be destroyed
  # (because twilio_flex_flex_flows_v1.messaging_flow is not in configuration)
  - resource "twilio_flex_flex_flows_v1" "messaging_flow" {
      - channel_type            = "sms" -> null
      - chat_service_sid        = "ISf738bd4fc2344d4093018a781f88a5b2" -> null
      - contact_identity        = "+14159973603" -> null
      - enabled                 = true -> null
      - friendly_name           = "Flex Messaging Channel Flow" -> null
      - id                      = "FO5e1ce35779833f4ae6c459674c71976f" -> null
      - integration_flow_sid    = "FW3d5182a8b4d2a0054269b7a9cf3b92ec" -> null
      - integration_retry_count = 3 -> null
      - integration_type        = "studio" -> null
      - janitor_enabled         = true -> null
      - long_lived              = false -> null
      - sid                     = "FO5e1ce35779833f4ae6c459674c71976f" -> null
    }

  # module.flex.twilio_flex_flex_flows_v1.webchat_flow will be destroyed
  # (because twilio_flex_flex_flows_v1.webchat_flow is not in configuration)
  - resource "twilio_flex_flex_flows_v1" "webchat_flow" {
      - channel_type            = "web" -> null
      - chat_service_sid        = "ISf738bd4fc2344d4093018a781f88a5b2" -> null
      - enabled                 = true -> null
      - friendly_name           = "Flex Web Channel Flow" -> null
      - id                      = "FOdeacec2cd86870221f4f7968306a3e2d" -> null
      - integration_flow_sid    = "FW3d5182a8b4d2a0054269b7a9cf3b92ec" -> null
      - integration_retry_count = 3 -> null
      - integration_type        = "studio" -> null
      - janitor_enabled         = true -> null
      - long_lived              = false -> null
      - sid                     = "FOdeacec2cd86870221f4f7968306a3e2d" -> null
    }

  # module.hrmServiceIntegration.null_resource.hrm_static_api_key will be created
  + resource "null_resource" "hrm_static_api_key" {
      + id       = (known after apply)
      + triggers = {
          + "environment"       = "Production"
          + "helpline"          = "Meri Trustline"
          + "short_environment" = "PROD"
          + "short_helpline"    = "IN"
        }
    }

  # module.services.null_resource.sync_api_key will be created
  + resource "null_resource" "sync_api_key" {
      + id       = (known after apply)
      + triggers = {
          + "environment"       = "Production"
          + "helpline"          = "Meri Trustline"
          + "short_environment" = "PROD"
          + "short_helpline"    = "IN"
        }
    }

  # module.studioFlow.twilio_studio_flows_v2.messaging_flow will be destroyed
  # (because twilio_studio_flows_v2.messaging_flow is not in configuration)
  - resource "twilio_studio_flows_v2" "messaging_flow" {
      - definition    = jsonencode(
            {
              - description   = "Bot flow for creating a Flex messaging task"
              - flags         = {
                  - allow_concurrent_calls = true
                }
              - initial_state = "Trigger"
              - states        = [
                  - {
                      - name        = "Trigger"
                      - properties  = {
                          - offset = {
                              - x = 0
                              - y = -70
                            }
                        }
                      - transitions = [
                          - {
                              - event = "incomingMessage"
                              - next  = "ChatBot"
                            },
                          - {
                              - event = "incomingCall"
                            },
                          - {
                              - event = "incomingRequest"
                            },
                        ]
                      - type        = "trigger"
                    },
                  - {
                      - name        = "smsAttributes"
                      - properties  = {
                          - attributes = <<-EOT
                                {"name": "{{trigger.message.ChannelAttributes.from}}", "channelType": "{{trigger.message.ChannelAttributes.channel_type}}", "channelSid": "{{trigger.message.ChannelSid}}", "twilioNumber": "{{trigger.message.ChannelAttributes.twilioNumber}}", "ignoreAgent":"", "transferTargetType":"",
                                "memory": {{widgets.ChatBot.memory | to_json}}}
                            EOT
                          - channel    = "TC5ab63b25fff0173f31faab16247c8b5c"
                          - offset     = {
                              - x = 270
                              - y = 810
                            }
                          - workflow   = "WWc4f623b080039c6244f6a213db6dcf76"
                        }
                      - transitions = [
                          - {
                              - event = "callComplete"
                            },
                          - {
                              - event = "failedToEnqueue"
                            },
                          - {
                              - event = "callFailure"
                            },
                        ]
                      - type        = "send-to-flex"
                    },
                  - {
                      - name        = "ChatBot"
                      - properties  = {
                          - autopilot_assistant_sid = "UA57ac070a5bfbbf0ba3ee957516d44bc5"
                          - body                    = "{{trigger.message.Body}}"
                          - chat_channel            = "{{trigger.message.ChannelSid}}"
                          - chat_service            = "{{trigger.message.InstanceSid}}"
                          - from                    = "Bot"
                          - offset                  = {
                              - x = -20
                              - y = 110
                            }
                          - target_task             = "greeting"
                          - timeout                 = 14400
                        }
                      - transitions = [
                          - {
                              - event = "sessionEnded"
                              - next  = "check_counselor_handoff"
                            },
                          - {
                              - event = "failure"
                            },
                        ]
                      - type        = "send-to-auto-pilot"
                    },
                  - {
                      - name        = "check_counselor_handoff"
                      - properties  = {
                          - input  = "{{widgets.ChatBot.CurrentTask}}"
                          - offset = {
                              - x = -20
                              - y = 340
                            }
                        }
                      - transitions = [
                          - {
                              - event = "noMatch"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{widgets.ChatBot.CurrentTask}}",
                                        ]
                                      - friendly_name = "If value equal_to counselor_handoff"
                                      - type          = "equal_to"
                                      - value         = "counselor_handoff"
                                    },
                                ]
                              - event      = "match"
                              - next       = "AdjustAttributes"
                            },
                        ]
                      - type        = "split-based-on"
                    },
                  - {
                      - name        = "defaultAttributes"
                      - properties  = {
                          - attributes = <<-EOT
                                {"name": "{{trigger.message.ChannelAttributes.from}}", "channelType": "{{trigger.message.ChannelAttributes.channel_type}}", "channelSid": "{{trigger.message.ChannelSid}}", "helpline": "", "ignoreAgent":"", "transferTargetType":"",
                                "memory": {{widgets.ChatBot.memory | to_json}}}
                            EOT
                          - channel    = "TCd55ad021703e7a4c16c0974ab76eb933"
                          - offset     = {
                              - x = -690
                              - y = 810
                            }
                          - workflow   = "WWc4f623b080039c6244f6a213db6dcf76"
                        }
                      - transitions = [
                          - {
                              - event = "callComplete"
                            },
                          - {
                              - event = "failedToEnqueue"
                            },
                          - {
                              - event = "callFailure"
                            },
                        ]
                      - type        = "send-to-flex"
                    },
                  - {
                      - name        = "whatsappAttributes"
                      - properties  = {
                          - attributes = <<-EOT
                                {"name": "{{trigger.message.ChannelAttributes.from}}", "channelType": "{{trigger.message.ChannelAttributes.channel_type}}", "channelSid": "{{trigger.message.ChannelSid}}", "twilioNumber": "{{trigger.message.ChannelAttributes.twilioNumber}}", "ignoreAgent":"", "transferTargetType":"",
                                "memory": {{widgets.ChatBot.memory | to_json}}}
                            EOT
                          - channel    = "TC5ab63b25fff0173f31faab16247c8b5c"
                          - offset     = {
                              - x = -370
                              - y = 810
                            }
                          - workflow   = "WWc4f623b080039c6244f6a213db6dcf76"
                        }
                      - transitions = [
                          - {
                              - event = "callComplete"
                            },
                          - {
                              - event = "failedToEnqueue"
                            },
                          - {
                              - event = "callFailure"
                            },
                        ]
                      - type        = "send-to-flex"
                    },
                  - {
                      - name        = "facebookAttributes"
                      - properties  = {
                          - attributes = <<-EOT
                                {"name": "{{trigger.message.ChannelAttributes.from}}", "channelType": "{{trigger.message.ChannelAttributes.channel_type}}", "channelSid": "{{trigger.message.ChannelSid}}", "twilioNumber": "{{trigger.message.ChannelAttributes.twilioNumber}}", "ignoreAgent":"", "transferTargetType":"",
                                "memory": {{widgets.ChatBot.memory | to_json}}}
                            EOT
                          - channel    = "TC5ab63b25fff0173f31faab16247c8b5c"
                          - offset     = {
                              - x = -50
                              - y = 810
                            }
                          - workflow   = "WWc4f623b080039c6244f6a213db6dcf76"
                        }
                      - transitions = [
                          - {
                              - event = "callComplete"
                            },
                          - {
                              - event = "failedToEnqueue"
                            },
                          - {
                              - event = "callFailure"
                            },
                        ]
                      - type        = "send-to-flex"
                    },
                  - {
                      - name        = "webAttributes"
                      - properties  = {
                          - attributes = <<-EOT
                                {"ip":"{{trigger.message.ChannelAttributes.pre_engagement_data.ip}}","name": "{{trigger.message.ChannelAttributes.from}}", "channelType": "{{trigger.message.ChannelAttributes.channel_type}}", "channelSid": "{{trigger.message.ChannelSid}}", "helpline": "{{trigger.message.ChannelAttributes.pre_engagement_data.helpline}}", "ignoreAgent":"", "transferTargetType":"",
                                "memory": {{widgets.ChatBot.memory | to_json}}}
                            EOT
                          - channel    = "TC5ab63b25fff0173f31faab16247c8b5c"
                          - offset     = {
                              - x = 590
                              - y = 810
                            }
                          - workflow   = "WWc4f623b080039c6244f6a213db6dcf76"
                        }
                      - transitions = [
                          - {
                              - event = "callComplete"
                            },
                          - {
                              - event = "failedToEnqueue"
                            },
                          - {
                              - event = "callFailure"
                            },
                        ]
                      - type        = "send-to-flex"
                    },
                  - {
                      - name        = "AdjustAttributes"
                      - properties  = {
                          - input  = "{{trigger.message.ChannelAttributes.channel_type}}"
                          - offset = {
                              - x = -200
                              - y = 560
                            }
                        }
                      - transitions = [
                          - {
                              - event = "noMatch"
                              - next  = "defaultAttributes"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{trigger.message.ChannelAttributes.channel_type}}",
                                        ]
                                      - friendly_name = "If value equal_to whatsapp"
                                      - type          = "equal_to"
                                      - value         = "whatsapp"
                                    },
                                ]
                              - event      = "match"
                              - next       = "whatsappAttributes"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{trigger.message.ChannelAttributes.channel_type}}",
                                        ]
                                      - friendly_name = "If value equal_to facebook"
                                      - type          = "equal_to"
                                      - value         = "facebook"
                                    },
                                ]
                              - event      = "match"
                              - next       = "facebookAttributes"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{trigger.message.ChannelAttributes.channel_type}}",
                                        ]
                                      - friendly_name = "If value equal_to sms"
                                      - type          = "equal_to"
                                      - value         = "sms"
                                    },
                                ]
                              - event      = "match"
                              - next       = "smsAttributes"
                            },
                          - {
                              - conditions = [
                                  - {
                                      - arguments     = [
                                          - "{{trigger.message.ChannelAttributes.channel_type}}",
                                        ]
                                      - friendly_name = "If value equal_to web"
                                      - type          = "equal_to"
                                      - value         = "web"
                                    },
                                ]
                              - event      = "match"
                              - next       = "webAttributes"
                            },
                        ]
                      - type        = "split-based-on"
                    },
                ]
            }
        ) -> null
      - friendly_name = "Messaging Flow" -> null
      - id            = "FW3d5182a8b4d2a0054269b7a9cf3b92ec" -> null
      - sid           = "FW3d5182a8b4d2a0054269b7a9cf3b92ec" -> null
      - status        = "published" -> null
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.chat has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["chat"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WS831977232a01fb12d14327b9b92c0f87/TC5ab63b25fff0173f31faab16247c8b5c"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.default has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["default"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WS831977232a01fb12d14327b9b92c0f87/TCd55ad021703e7a4c16c0974ab76eb933"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.email has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["email"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WS831977232a01fb12d14327b9b92c0f87/TCe9669913ea8a1d836fc3cd35baeaa37a"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.sms has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["sms"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WS831977232a01fb12d14327b9b92c0f87/TC76a0c664519bb00d1bc19a739fc2f147"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["survey"] will be created
  + resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
      + channel_optimized_routing = (known after apply)
      + friendly_name             = "Survey"
      + id                        = (known after apply)
      + sid                       = (known after apply)
      + unique_name               = "survey"
      + workspace_sid             = "WS831977232a01fb12d14327b9b92c0f87"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.video has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["video"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WS831977232a01fb12d14327b9b92c0f87/TC409826fb7403192ca3f952030eac80ac"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.voice has moved to module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["voice"]
    resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
        id                        = "WS831977232a01fb12d14327b9b92c0f87/TC9cae459becd0a09095ba47e058bba967"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.task_queue["e2e_test"] will be created
  + resource "twilio_taskrouter_workspaces_task_queues_v1" "task_queue" {
      + assignment_activity_sid  = (known after apply)
      + friendly_name            = "E2E Test Queue"
      + id                       = (known after apply)
      + max_reserved_workers     = (known after apply)
      + reservation_activity_sid = (known after apply)
      + sid                      = (known after apply)
      + target_workers           = "email=='aselo-alerts+production@techmatters.org'"
      + task_order               = (known after apply)
      + workspace_sid            = "WS831977232a01fb12d14327b9b92c0f87"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.task_queue["master"] will be updated in-place
  # (moved from module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.helpline_queue)
  ~ resource "twilio_taskrouter_workspaces_task_queues_v1" "task_queue" {
      ~ friendly_name        = "MERI Trustline" -> "Meri Trustline"
        id                   = "WS831977232a01fb12d14327b9b92c0f87/WQ4bef9520f1d7929b0bb27e06038fd0c3"
        # (5 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_v1.flex_task_assignment will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_v1" "flex_task_assignment" {
      ~ events_filter          = "task.created,task.canceled,task.completed,task.deleted,task-queue.entered,reservation.wrapup,reservation.accepted,reservation.rejected,reservation.timeout,task.system-deleted,task.wrapup" -> "task.created,task.canceled,task.completed,task.deleted,task.wrapup,task-queue.entered,task.system-deleted,reservation.accepted,reservation.rejected,reservation.timeout,reservation.wrapup"
        id                     = "WS831977232a01fb12d14327b9b92c0f87"
        # (7 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["master"] will be updated in-place
  # (moved from module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.master_workflow)
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
            {
              - task_routing = {
                  - filters = [
                      - {
                          - expression           = "isContactlessTask==true"
                          - filter_friendly_name = "MERI Trustline"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQ4bef9520f1d7929b0bb27e06038fd0c3"
                                },
                            ]
                        },
                    ]
                }
            }
        ) -> (known after apply)
        id                       = "WS831977232a01fb12d14327b9b92c0f87/WWc4f623b080039c6244f6a213db6dcf76"
        # (4 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["survey"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
          ~ {
              ~ task_routing = {
                  ~ filters = [
                      ~ {
                          ~ expression           = "helpline=='Aarambh'" -> "isChatCaptureControl==true"
                          ~ filter_friendly_name = "Survey Filter" -> "CaptureChannel"
                          ~ targets              = [
                              ~ {
                                  - expression = "isSurveyTask==true"
                                    # (1 unchanged attribute hidden)
                                },
                            ]
                        },
                    ]
                }
            }
        )
      ~ friendly_name            = "Survey" -> "Survey Workflow"
        id                       = "WS831977232a01fb12d14327b9b92c0f87/WW0f538ca16c9fda7f97d1094344b103e2"
        # (3 unchanged attributes hidden)
    }

Plan: 24 to add, 8 to change, 5 to destroy.
